# Gravity Assist

There are 4 *sulci* (a sulcus is a subparallel furrow or ridge), collectively called *the Tiger Stripes*, on the surface of Enceladus that make up the sole source of plumes from this moon. Named after places in *A thousand and one arabian nights*, they are called

- Cairo
- Baghdad
- Alexandria
- Damascus

Each are about 130 km long by 2 km wide. Source of the plume is suspected to originate from the moon's **porous** core. Area of interest is 1500 km above the surface. Since the sulci cover almost 150 km, and Enceladus has a diameter of 504 km, if we think it came from the core this translates to an angle of

$$
\theta = 150 / (504 * \pi) / 360\deg = 34
$$

Extending from the core, through the surface, out 4000 km to space (so that our 1500 km area of interest is in the centre), that's the analytical window.

Find when Cassini when it enters and leaves this cone of interest.

Assumptions:

- each nadir centered on the south pole where the Tiger Stripes are; analytics team will adjust for it themselves
- Cassini flys orthogonal to the surface of the southpole; it being a straight line is probably fair given the speed of the flybys, but *orthogonal* requires some imagination right? Actually it may be a consequence of the first assumption, if we also assume a straight line

In [1]:
%load_ext sql

In [2]:
import os
from dotenv import load_dotenv

In [3]:
load_dotenv("../.env")
user = os.environ.get('POSTGRES_USER')
pw = os.environ.get('POSTGRES_PASSWORD')
db_name = os.environ.get('POSTGRES_DB')
host = 'localhost'
port = 5432
conn_str = f'postgresql://{user}:{pw}@{host}:{port}/{db_name}'

In [4]:
%sql $conn_str

In [6]:
%%sql
select * from flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075'), 'E-0', None, None, 1),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370'), 'E-1', None, None, 2),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012'), 'E-2', None, None, 3),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292'), 'E-3', None, None, 4),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353'), 'E-4', None, None, 5),
 (datetime.datetime(2008, 10, 9, 19, 6, 39, 724000), Decimal('28.576'), 'E-5', None, None, 6),
 (datetime.datetime(2008, 10, 31, 17, 14, 51, 429000), Decimal('173.044'), 'E-6', None, None, 7),
 (datetime.datetime(2009, 11, 2, 7, 41, 57, 707000), Decimal('98.901'), 'E-7', None, None, 8),
 (datetime.datetime(2009, 11, 21, 2, 9, 56, 371000), Decimal('1596.561'), 'E-8', None, None, 9),
 (datetime.datetime(2010, 4, 28, 0, 0, 1, 88000), Decimal('3771.195'), 'E-9', None, None, 10),
 (datetime.datetime(2010, 5, 18, 6, 4, 40, 301000), Decimal('437.292'), 'E-10', None, None, 11),
 (datetime.datetime(2010, 8, 13, 22, 30, 51, 975000), Decimal('2555.180'), 'E-11', None, None, 12),
 (datetime.datetime(2010, 11, 30, 11, 53, 59, 49000), Decimal('45.699'), 'E-12', None, None, 13),
 (datetime.datetime(2010, 12, 21, 1, 8, 27, 146000), Decimal('48.324'), 'E-13', None, None, 14),
 (datetime.datetime(2011, 10, 1, 13, 52, 25, 698000), Decimal('98.898'), 'E-14', None, None, 15),
 (datetime.datetime(2011, 10, 19, 9, 22, 11, 224500), Decimal('1230.674'), 'E-15', None, None, 16),
 (datetime.datetime(2011, 11, 6, 4, 58, 53, 480500), Decimal('496.603'), 'E-16', None, None, 17),
 (datetime.datetime(2012, 3, 27, 18, 30, 8, 975000), Decimal('74.165'), 'E-17', None, None, 18),
 (datetime.datetime(2012, 4, 14, 14, 1, 37, 811000), Decimal('74.100'), 'E-18', None, None, 19),
 (datetime.datetime(2012, 5, 2, 9, 31, 28, 949000), Decimal('73.134'), 'E-19', None, None, 20),
 (datetime.datetime(2015, 10, 14, 10, 41, 28, 976500), Decimal('1844.230'), 'E-20', None, None, 21),
 (datetime.datetime(2015, 10, 28, 15, 22, 41, 550000), Decimal('49.010'), 'E-21', None, None, 22),
 (datetime.datetime(2015, 12, 19, 17, 49, 16, 113500), Decimal('5000.200'), 'E-22', None, None, 23)]

In [14]:
%%sql
-- set the table
ALTER TABLE public.flybys
ADD speed_kms numeric(10,3),
ADD target_altitude numeric(10,3),
ADD transit_distance numeric(10,3);

 * postgresql://postgres:***@localhost:5432/enceladus
Done.

[]

Calculate our triangle; first confirm the numbers in a SELECT query

In [15]:
%%sql
-- sin defaults to radians; sind for degrees
select
    name,
    altitude,
    (altitude + 252) / sind(73) - 252 as target_altitude,
    (altitude + 252) / sind(73) * sind(17) * 2 as transit_distance
from flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[('E-0', Decimal('1272.075'), 1341.7126637681502, 931.9129766882158),
 ('E-1', Decimal('500.370'), 534.7471068282356, 460.04518561810477),
 ('E-2', Decimal('168.012'), 187.20308602568002, 256.8211099616298),
 ('E-3', Decimal('50.292'), 64.10425245201293, 184.83987831900276),
 ('E-4', Decimal('53.353'), 67.30511491862012, 186.7115615508927),
 ('E-5', Decimal('28.576'), 41.39601026813807, 171.56138336189025),
 ('E-6', Decimal('173.044'), 192.46500694432336, 259.89798353982974),
 ('E-7', Decimal('98.901'), 114.93428304309674, 214.56240370905084),
 ('E-8', Decimal('1596.561'), 1681.024999063639, 1130.3236284958057),
 ('E-9', Decimal('3771.195'), 3955.021846240312, 2460.0282979821513),
 ('E-10', Decimal('437.292'), 468.78696221253927, 421.475425768006),
 ('E-11', Decimal('2555.180'), 2683.444984975592, 1716.4821087542448),
 ('E-12', Decimal('45.699'), 59.30139021446752, 182.03143627912354),
 ('E-13', Decimal('48.324'), 62.04633107524626, 183.63652235678148),
 ('E-14', Decimal('98.898'), 114.93114596782732, 214.5605693249621),
 ('E-15', Decimal('1230.674'), 1298.4199793578257, 906.5978648020758),
 ('E-16', Decimal('496.603'), 530.8079859815484, 457.7418106639952),
 ('E-17', Decimal('74.165'), 89.06805175463069, 199.437295435928),
 ('E-18', Decimal('74.100'), 89.00008179045898, 199.39755044733835),
 ('E-19', Decimal('73.134'), 87.9899435536924, 198.80687877076022),
 ('E-20', Decimal('1844.230'), 1940.0104307010542, 1281.7636527881757),
 ('E-21', Decimal('49.010'), 62.76367562019641, 184.05598485174275),
 ('E-22', Decimal('5000.200'), 5240.182243421799, 3211.5173703143532)]

Update our flybys table

In [16]:
%%sql
-- hypotenuse
UPDATE flybys
SET target_altitude = (altitude + 252) / sind(73) - 252;
-- transit dist
UPDATE flybys
SET transit_distance = (altitude + 252) / sind(73) * sind(17) * 2;
-- visual check
SELECT * FROM flybys LIMIT 5;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.
23 rows affected.
5 rows affected.

[(datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075'), 'E-0', None, None, 1, None, Decimal('1341.713'), Decimal('931.913')),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370'), 'E-1', None, None, 2, None, Decimal('534.747'), Decimal('460.045')),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012'), 'E-2', None, None, 3, None, Decimal('187.203'), Decimal('256.821')),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292'), 'E-3', None, None, 4, None, Decimal('64.104'), Decimal('184.840')),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353'), 'E-4', None, None, 5, None, Decimal('67.305'), Decimal('186.712'))]

In [22]:
%%sql
-- public.flyby_altitudes view we materialized a while back
select * from pg_matviews;

 * postgresql://postgres:***@localhost:5432/enceladus
2 rows affected.

[('public', 'flyby_altitudes', 'postgres', None, False, True, " SELECT (inms.sclk)::timestamp without time zone AS time_stamp,\n    date_part('year'::text, (inms.sclk)::timestamp without time zone) AS year,\n     ... (66 characters truncated) ... AS week,\n    (inms.alt_t)::numeric(10,3) AS altitude\n   FROM import.inms\n  WHERE ((inms.target = 'ENCELADUS'::text) AND (inms.alt_t IS NOT NULL));"),
 ('public', 'enceladus_events', 'postgres', None, True, True, " SELECT events.id,\n    events.title,\n    events.description,\n    events.time_stamp,\n    (events.time_stamp)::date AS date,\n    event_types.descr ... (91 characters truncated) ... n   FROM (events\n     JOIN event_types ON ((event_types.id = events.event_type_id)))\n  WHERE (events.target_id = 28)\n  ORDER BY events.time_stamp;")]

In [8]:
%%sql
select 
    min(time_stamp) as start
from flyby_altitudes
WHERE time_stamp::date = flybys.time_stamp::date
AND ABS(flybys.target_altitude - altitude) < 0.75;

 * postgresql://postgres:***@localhost:5432/enceladus
(psycopg2.errors.UndefinedTable) missing FROM-clause entry for table "flybys"
LINE 4: WHERE time_stamp::date = flybys.time_stamp::date
                                 ^

[SQL: select
    min(time_stamp) as start
from flyby_altitudes
WHERE time_stamp::date = flybys.time_stamp::date
AND ABS(flybys.target_altitude - altitude) < 0.75;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [20]:
%%sql
SELECT
    f.name AS name,
    f.target_altitude AS target,
    MIN(fa.time_stamp) AS start,
    MAX(fa.altitude) AS alt
FROM flyby_altitudes AS fa
LEFT JOIN flybys AS f
ON fa.time_stamp::date = f.time_stamp::date
WHERE ABS(f.target_altitude - fa.altitude) < 0.75
GROUP BY name, target
ORDER BY start;

 * postgresql://postgres:***@localhost:5432/enceladus
21 rows affected.

[('E-1', Decimal('534.747'), datetime.datetime(2005, 3, 9, 9, 7, 28, 48000), Decimal('535.463')),
 ('E-2', Decimal('187.203'), datetime.datetime(2005, 7, 14, 19, 55, 6, 387000), Decimal('187.927')),
 ('E-3', Decimal('64.104'), datetime.datetime(2008, 3, 12, 19, 6, 5, 91000), Decimal('64.832')),
 ('E-4', Decimal('67.305'), datetime.datetime(2008, 8, 11, 21, 6, 13, 260000), Decimal('67.998')),
 ('E-5', Decimal('41.396'), datetime.datetime(2008, 10, 9, 19, 6, 34, 836000), Decimal('42.059')),
 ('E-6', Decimal('192.465'), datetime.datetime(2008, 10, 31, 17, 14, 44, 45000), Decimal('193.140')),
 ('E-7', Decimal('114.934'), datetime.datetime(2009, 11, 2, 7, 41, 43, 312000), Decimal('115.655')),
 ('E-8', Decimal('1681.025'), datetime.datetime(2009, 11, 21, 2, 8, 42, 929000), Decimal('1681.765')),
 ('E-10', Decimal('468.787'), datetime.datetime(2010, 5, 18, 6, 4, 7, 419000), Decimal('469.515')),
 ('E-11', Decimal('2683.445'), datetime.datetime(2010, 8, 13, 22, 28, 45, 979000), Decimal('2684.161')),
 ('E-12', Decimal('59.301'), datetime.datetime(2010, 11, 30, 11, 53, 43, 943000), Decimal('60.048')),
 ('E-13', Decimal('62.046'), datetime.datetime(2010, 12, 21, 1, 8, 11, 780000), Decimal('62.781')),
 ('E-14', Decimal('114.931'), datetime.datetime(2011, 10, 1, 13, 52, 10, 740000), Decimal('115.620')),
 ('E-15', Decimal('1298.420'), datetime.datetime(2011, 10, 19, 9, 21, 10, 227000), Decimal('1299.141')),
 ('E-16', Decimal('530.808'), datetime.datetime(2011, 11, 6, 4, 58, 21, 952000), Decimal('531.547')),
 ('E-17', Decimal('89.068'), datetime.datetime(2012, 3, 27, 18, 29, 55, 109000), Decimal('89.803')),
 ('E-18', Decimal('89.000'), datetime.datetime(2012, 4, 14, 14, 1, 23, 945000), Decimal('89.713')),
 ('E-19', Decimal('87.990'), datetime.datetime(2012, 5, 2, 9, 31, 15, 181000), Decimal('88.738')),
 ('E-20', Decimal('1940.010'), datetime.datetime(2015, 10, 14, 10, 40, 13, 208000), Decimal('1940.720')),
 ('E-21', Decimal('62.764'), datetime.datetime(2015, 10, 28, 15, 22, 30, 214000), Decimal('63.450')),
 ('E-22', Decimal('5240.182'), datetime.datetime(2015, 12, 19, 17, 46, 27, 339000), Decimal('5240.890'))]

Missing E-0 and E-9???

Apparently the INMS data just skipped a second, and so the altitude data where it should have matched the `WHERE` clause is just missing

NASA/JPL has a list of flyby altitudes/speeds. [Info for E-22](https://science.nasa.gov/missions/cassini/enceladus-flyby-22-e-22-final-visit-to-enceladus/). Compile them by hand into `data/jpl_flybys.csv`

In [21]:
with open('../curious/data/jpl_flybys.csv') as f:
    jpl_csv = f.read()
    print(jpl_csv)

﻿id,name,date,altitude,speed
1,E-0,17-Feb-05,,
2,E-1,9-Mar-05,504,
3,E-2,14-Jul-05,172,8.2
4,E-3,12-Mar-08,52,14.4
5,E-4,11-Aug-08,50,17.7
6,E-5,9-Oct-08,25,17.7
7,E-6,31-Oct-08,197,17.7
8,E-7,2-Nov-09,103,7.7
9,E-8,21-Nov-09,1606,7.7
10,E-9,28-Apr-10,100,6.5
11,E-10,18-May-10,438,6.5
12,E-11,13-Aug-10,2502,6.8
13,E-12,30-Nov-10,47.9,6.3
14,E-13,21-Dec-10,47.8,6.2
15,E-14,1-Oct-11,99,7.4
16,E-15,19-Oct-11,1231,7.4
17,E-16,6-Nov-11,496,7.4
18,E-17,27-Mar-12,74,7.5
19,E-18,14-Apr-12,74,7.5
20,E-19,2-May-12,74,7.5
21,E-20,14-Oct-15,1839,8.5
22,E-21,28-Oct-15,49,8.5
23,E-22,19-Dec-15,4999,9.5

Only dates not timestamps, and some values are still missing. If NASA didn't publish it, then there's no point looking through INMS or CDA data. Import to `flybys` in our database

In [15]:
%%sql
-- insert hand-compiled data, gathered from NASA's Cassini flyby page
CREATE TABLE jpl_flybys(
    id INT PRIMARY KEY,
    name text not null,
    date date not null,
    altitude numeric(7,1),
    speed numeric(7,1)
);
COPY jpl_flybys
FROM '/home/curious/data/jpl_flybys.csv'
DELIMITER ',' HEADER CSV;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
23 rows affected.

[]

In [24]:
%%sql
select * from jpl_flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(1, 'E-0', datetime.date(2005, 2, 17), None, None),
 (2, 'E-1', datetime.date(2005, 3, 9), Decimal('504.0'), None),
 (3, 'E-2', datetime.date(2005, 7, 14), Decimal('172.0'), Decimal('8.2')),
 (4, 'E-3', datetime.date(2008, 3, 12), Decimal('52.0'), Decimal('14.4')),
 (5, 'E-4', datetime.date(2008, 8, 11), Decimal('50.0'), Decimal('17.7')),
 (6, 'E-5', datetime.date(2008, 10, 9), Decimal('25.0'), Decimal('17.7')),
 (7, 'E-6', datetime.date(2008, 10, 31), Decimal('197.0'), Decimal('17.7')),
 (8, 'E-7', datetime.date(2009, 11, 2), Decimal('103.0'), Decimal('7.7')),
 (9, 'E-8', datetime.date(2009, 11, 21), Decimal('1606.0'), Decimal('7.7')),
 (10, 'E-9', datetime.date(2010, 4, 28), Decimal('100.0'), Decimal('6.5')),
 (11, 'E-10', datetime.date(2010, 5, 18), Decimal('438.0'), Decimal('6.5')),
 (12, 'E-11', datetime.date(2010, 8, 13), Decimal('2502.0'), Decimal('6.8')),
 (13, 'E-12', datetime.date(2010, 11, 30), Decimal('47.9'), Decimal('6.3')),
 (14, 'E-13', datetime.date(2010, 12, 21), Decimal('47.8'), Decimal('6.2')),
 (15, 'E-14', datetime.date(2011, 10, 1), Decimal('99.0'), Decimal('7.4')),
 (16, 'E-15', datetime.date(2011, 10, 19), Decimal('1231.0'), Decimal('7.4')),
 (17, 'E-16', datetime.date(2011, 11, 6), Decimal('496.0'), Decimal('7.4')),
 (18, 'E-17', datetime.date(2012, 3, 27), Decimal('74.0'), Decimal('7.5')),
 (19, 'E-18', datetime.date(2012, 4, 14), Decimal('74.0'), Decimal('7.5')),
 (20, 'E-19', datetime.date(2012, 5, 2), Decimal('74.0'), Decimal('7.5')),
 (21, 'E-20', datetime.date(2015, 10, 14), Decimal('1839.0'), Decimal('8.5')),
 (22, 'E-21', datetime.date(2015, 10, 28), Decimal('49.0'), Decimal('8.5')),
 (23, 'E-22', datetime.date(2015, 12, 19), Decimal('4999.0'), Decimal('9.5'))]

Focus is on flybys that are closest to the sulci; perhaps the each sulcus is different from each other. Without accurate windows (now that we don't have timestamps) the analytical team needs a different approach, orrrr

We augment our own calculations with the hard data sourced from NASA

In [16]:
%%sql
-- temporary table, to be dropped, rather than mat view
DROP TABLE IF EXISTS time_alts;
SELECT
    (sclk::timestamp) as time_stamp,
    alt_t::numeric(8,2) as altitude,
    date_part('year', (sclk::timestamp)) as year,
    date_part('week', (sclk::timestamp)) as week
INTO time_alts
FROM import.inms
WHERE target='ENCELADUS'
AND alt_t IS NOT NULL;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
4931008 rows affected.

[]

Reminder to use `timestamp without time zone` so postgres doesn't automatically change things

Group by year, week since flybys are never within the same week

In [27]:
%%sql
SELECT
    MIN(altitude) AS nadir,
    year, week
FROM time_alts
GROUP BY year, week
ORDER BY year, week

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(Decimal('1272.08'), 2005.0, 7.0),
 (Decimal('500.37'), 2005.0, 10.0),
 (Decimal('168.01'), 2005.0, 28.0),
 (Decimal('50.29'), 2008.0, 11.0),
 (Decimal('53.35'), 2008.0, 33.0),
 (Decimal('28.58'), 2008.0, 41.0),
 (Decimal('173.04'), 2008.0, 44.0),
 (Decimal('98.90'), 2009.0, 45.0),
 (Decimal('1596.56'), 2009.0, 47.0),
 (Decimal('3771.20'), 2010.0, 17.0),
 (Decimal('437.29'), 2010.0, 20.0),
 (Decimal('2555.18'), 2010.0, 32.0),
 (Decimal('45.70'), 2010.0, 48.0),
 (Decimal('48.32'), 2010.0, 51.0),
 (Decimal('98.90'), 2011.0, 39.0),
 (Decimal('1230.67'), 2011.0, 42.0),
 (Decimal('496.60'), 2011.0, 44.0),
 (Decimal('74.17'), 2012.0, 13.0),
 (Decimal('74.10'), 2012.0, 15.0),
 (Decimal('73.13'), 2012.0, 18.0),
 (Decimal('1844.23'), 2015.0, 42.0),
 (Decimal('49.01'), 2015.0, 44.0),
 (Decimal('5000.20'), 2015.0, 51.0)]

Now, back to the timestamps

In [5]:
%%sql
WITH mins as (
    SELECT
        MIN(altitude) AS nadir,
        year, week
    FROM time_alts
    GROUP BY year, week
    ORDER BY year, week
)
SELECT m.*,
    MIN(time_stamp) AS low_time
FROM mins AS m
INNER JOIN time_alts AS ta
ON m.year = ta.year
AND m.week = ta.week
AND m.nadir = ta.altitude
GROUP BY m.week, m.year, m.nadir
ORDER BY m.year, m.week

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(Decimal('1272.08'), 2005.0, 7.0, datetime.datetime(2005, 2, 17, 3, 30, 12, 119000)),
 (Decimal('500.37'), 2005.0, 10.0, datetime.datetime(2005, 3, 9, 9, 8, 3, 98000)),
 (Decimal('168.01'), 2005.0, 28.0, datetime.datetime(2005, 7, 14, 19, 55, 22, 143000)),
 (Decimal('50.29'), 2008.0, 11.0, datetime.datetime(2008, 3, 12, 19, 6, 11, 458000)),
 (Decimal('53.35'), 2008.0, 33.0, datetime.datetime(2008, 8, 11, 21, 6, 18, 523000)),
 (Decimal('28.58'), 2008.0, 41.0, datetime.datetime(2008, 10, 9, 19, 6, 39, 605000)),
 (Decimal('173.04'), 2008.0, 44.0, datetime.datetime(2008, 10, 31, 17, 14, 51, 429000)),
 (Decimal('98.90'), 2009.0, 45.0, datetime.datetime(2009, 11, 2, 7, 41, 57, 503000)),
 (Decimal('1596.56'), 2009.0, 47.0, datetime.datetime(2009, 11, 21, 2, 9, 55, 929000)),
 (Decimal('3771.20'), 2010.0, 17.0, datetime.datetime(2010, 4, 28, 0, 0, 1, 88000)),
 (Decimal('437.29'), 2010.0, 20.0, datetime.datetime(2010, 5, 18, 6, 4, 40, 29000)),
 (Decimal('2555.18'), 2010.0, 32.0, datetime.datetime(2010, 8, 13, 22, 30, 51, 215000)),
 (Decimal('45.70'), 2010.0, 48.0, datetime.datetime(2010, 11, 30, 11, 53, 58, 777000)),
 (Decimal('48.32'), 2010.0, 51.0, datetime.datetime(2010, 12, 21, 1, 8, 27, 61000)),
 (Decimal('98.90'), 2011.0, 39.0, datetime.datetime(2011, 10, 1, 13, 52, 25, 409000)),
 (Decimal('1230.67'), 2011.0, 42.0, datetime.datetime(2011, 10, 19, 9, 22, 11, 139000)),
 (Decimal('496.60'), 2011.0, 44.0, datetime.datetime(2011, 11, 6, 4, 58, 53, 259000)),
 (Decimal('74.17'), 2012.0, 13.0, datetime.datetime(2012, 3, 27, 18, 30, 8, 617000)),
 (Decimal('74.10'), 2012.0, 15.0, datetime.datetime(2012, 4, 14, 14, 1, 37, 590000)),
 (Decimal('73.13'), 2012.0, 18.0, datetime.datetime(2012, 5, 2, 9, 31, 28, 864000)),
 (Decimal('1844.23'), 2015.0, 42.0, datetime.datetime(2015, 10, 14, 10, 41, 28, 760000)),
 (Decimal('49.01'), 2015.0, 44.0, datetime.datetime(2015, 10, 28, 15, 22, 41, 414000)),
 (Decimal('5000.20'), 2015.0, 51.0, datetime.datetime(2015, 12, 19, 17, 49, 15, 275000))]

Okay these are basically the same timestamps as before, but now we're augmenting them with *actual* nadir and velocity data from JPL

Use 40 second analysis window as the basis

In [17]:
%%sql
DROP TABLE IF EXISTS flybys_2;
WITH mins as (
    SELECT
        MIN(altitude) AS nadir,
        year, week
    FROM time_alts
    GROUP BY year, week
    ORDER BY year, week
), min_times as (
    SELECT m.*,
        MIN(time_stamp) AS low_time,
        MIN(time_stamp) + INTERVAL '20 seconds' AS window_end,
        MIN(time_stamp) - INTERVAL '20 seconds' AS window_start    
    FROM mins AS m
    INNER JOIN time_alts AS ta
    ON m.year = ta.year
    AND m.week = ta.week
    AND m.nadir = ta.altitude
    GROUP BY m.week, m.year, m.nadir
), fixed_flybys as (
    SELECT
        f.id,
        f.date,
        f.altitude,
        f.speed,
        mt.nadir,
        mt.year::INTEGER,
        mt.week::INTEGER,
        mt.low_time,
        mt.window_start,
        mt.window_end
    FROM jpl_flybys f
    INNER JOIN min_times AS mt
    ON DATE_PART('year', f.date) = mt.year
    AND DATE_PART('week', f.date) = mt.week
) 
--create table from above
SELECT * 
INTO flybys_2
FROM fixed_flybys
ORDER BY date;

-- add key using existing id column
ALTER TABLE flybys_2
ADD PRIMARY KEY (id);

-- drop "temp" tables
DROP TABLE IF EXISTS jpl_flybys cascade;
DROP TABLE IF EXISTS time_alts;

-- rename table
ALTER TABLE flybys
RENAME TO flybys_archive;

ALTER TABLE flybys_2
RENAME TO flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
23 rows affected.
Done.
Done.
Done.
(psycopg2.errors.DuplicateTable) relation "flybys" already exists

[SQL: -- rename table
ALTER TABLE flybys_2
RENAME TO flybys;]
(Background on this error at: https://sqlalche.me/e/20/f405)

Difference between published flyby altitudes and calculated nadirs are fairly close:

In [24]:
%%sql
SELECT
    id,
    altitude,
    nadir,
    CASE
    WHEN altitude > 0 THEN
    ROUND(((nadir - altitude) / altitude * 100), 2)
    ELSE 0.0
    END AS diffpct
FROM flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(1, None, Decimal('1272.08'), Decimal('0.0')),
 (2, Decimal('504.0'), Decimal('500.37'), Decimal('-0.72')),
 (3, Decimal('172.0'), Decimal('168.01'), Decimal('-2.32')),
 (4, Decimal('52.0'), Decimal('50.29'), Decimal('-3.29')),
 (5, Decimal('50.0'), Decimal('53.35'), Decimal('6.70')),
 (6, Decimal('25.0'), Decimal('28.58'), Decimal('14.32')),
 (7, Decimal('197.0'), Decimal('173.04'), Decimal('-12.16')),
 (8, Decimal('103.0'), Decimal('98.90'), Decimal('-3.98')),
 (9, Decimal('1606.0'), Decimal('1596.56'), Decimal('-0.59')),
 (10, Decimal('100.0'), Decimal('3771.20'), Decimal('3671.20')),
 (11, Decimal('438.0'), Decimal('437.29'), Decimal('-0.16')),
 (12, Decimal('2502.0'), Decimal('2555.18'), Decimal('2.13')),
 (13, Decimal('47.9'), Decimal('45.70'), Decimal('-4.59')),
 (14, Decimal('47.8'), Decimal('48.32'), Decimal('1.09')),
 (15, Decimal('99.0'), Decimal('98.90'), Decimal('-0.10')),
 (16, Decimal('1231.0'), Decimal('1230.67'), Decimal('-0.03')),
 (17, Decimal('496.0'), Decimal('496.60'), Decimal('0.12')),
 (18, Decimal('74.0'), Decimal('74.17'), Decimal('0.23')),
 (19, Decimal('74.0'), Decimal('74.10'), Decimal('0.14')),
 (20, Decimal('74.0'), Decimal('73.13'), Decimal('-1.18')),
 (21, Decimal('1839.0'), Decimal('1844.23'), Decimal('0.28')),
 (22, Decimal('49.0'), Decimal('49.01'), Decimal('0.02')),
 (23, Decimal('4999.0'), Decimal('5000.20'), Decimal('0.02'))]

Mark certain flybys as `targeted`, as indicated by end-user, by adding a boolean column

In [25]:
%%sql
ALTER TABLE flybys
ADD targeted BOOLEAN NOT NULL DEFAULT FALSE;

UPDATE flybys
SET targeted=TRUE
WHERE id in (3,5,7,17,18,21);

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
6 rows affected.

[]

## INMS Tutorial

[INMS doc - PDF warning](http://inms.space.swri.edu/documentation/0890052-AnalysisTutorial.pdf)

Description of the xyz velocities are different here; they are relative to *target*, not Saturn as was specified in manifest